; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p2)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 - Aircraft
 c1 c2 c3 c4 c5 - City
 p1 p2 p3 p4 p5 p6 p7 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c1)
(at p1 c3)
(at p2 c5)
(at p3 c5)
(at p4 c2)
(at p5 c1)
(at p6 c1)
(at p7 c4)
)
(:goal (and
(at a1 c1)
(at p1 c4)
(at p2 c4)
(at p3 c4)
(at p4 c5)
(at p5 c4)
(at p6 c4)
(at p7 c4)
))
)

; plan
1. (fly a1 c1 c3 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 1 of 8
2. (board p1 a1 c3)
   deleted: (at p1 c3)
   added: (in p1 a1)
   goals met: 1 of 8
3. (fly a1 c3 c4 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 1 of 8
4. (debark p1 a1 c4)
   deleted: (in p1 a1)
   added: (at p1 c4)
   goals met: 2 of 8
5. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 2 of 8
6. (fly a1 c4 c5 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c5) (fuel-level a1 f1)
   goals met: 2 of 8
7. (board p2 a1 c5)
   deleted: (at p2 c5)
   added: (in p2 a1)
   goals met: 2 of 8
8. (fly a1 c5 c4 f1 f0)
   deleted: (at a1 c5) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 2 of 8
9. (debark p2 a1 c4)
   deleted: (in p2 a1)
   added: (at p2 c4)
   goals met: 3 of 8
10. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 3 of 8
11. (fly a1 c4 c5 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c5) (fuel-level a1 f1)
   goals met: 3 of 8
12. (board p3 a1 c5)
   deleted: (at p3 c5)
   added: (in p3 a1)
   goals met: 3 of 8
13. (fly a1 c5 c4 f1 f0)
   deleted: (at a1 c5) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 3 of 8
14. (debark p3 a1 c4)
   deleted: (in p3 a1)
   added: (at p3 c4)
   goals met: 4 of 8
15. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 4 of 8
16. (fly a1 c4 c2 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 4 of 8
17. (board p4 a1 c2)
   deleted: (at p4 c2)
   added: (in p4 a1)
   goals met: 4 of 8
18. (fly a1 c2 c5 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 4 of 8
19. (debark p4 a1 c5)
   deleted: (in p4 a1)
   added: (at p4 c5)
   goals met: 5 of 8
20. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 5 of 8
21. (fly a1 c5 c1 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 6 of 8
22. (board p5 a1 c1)
   deleted: (at p5 c1)
   added: (in p5 a1)
   goals met: 6 of 8
23. (fly a1 c1 c4 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 5 of 8
24. (debark p5 a1 c4)
   deleted: (in p5 a1)
   added: (at p5 c4)
   goals met: 6 of 8
25. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 6 of 8
26. (fly a1 c4 c1 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 7 of 8
27. (board p6 a1 c1)
   deleted: (at p6 c1)
   added: (in p6 a1)
   goals met: 7 of 8
28. (fly a1 c1 c4 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 6 of 8
29. (debark p6 a1 c4)
   deleted: (in p6 a1)
   added: (at p6 c4)
   goals met: 7 of 8
30. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 7 of 8
31. (fly a1 c4 c1 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 8 of 8
